Transform the scraped as well as downloaded CSV file as required

In [1]:
import pandas as pd
import csv

In [2]:
scraped = pd.read_csv('AAPL_scraped.csv')
kaggle = pd.read_csv('AAP_kaggle.csv')

EDA and analysis about dataset downloaded from Kaggle

In [5]:
kaggle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1259 non-null   object
 1   open    1259 non-null   float64
 2   high    1259 non-null   float64
 3   low     1259 non-null   float64
 4   close   1259 non-null   float64
 5   volume  1259 non-null   int64
 6   Name    1259 non-null   object
dtypes: float64(4), int64(1), object(2)
memory usage: 69.0+ KB

In [6]:
kaggle.isna().sum()

date      0
open      0
high      0
low       0
close     0
volume    0
Name      0
dtype: int64

In [7]:
kaggle.columns

Index(['date', 'open', 'high', 'low', 'close', 'volume', 'Name'], dtype='object')

Seeing the columns, the Name column is not required as all the data are of Apple Stock. So, drop the Name column.

In [8]:
#drop the name column
kaggle.drop('Name', axis=1, inplace=True)

In [9]:
kaggle.head()

         date   open   high      low  close   volume
0  2013-02-08  78.34  79.72  78.0100  78.90  1298137
1  2013-02-11  78.65  78.91  77.2300  78.39   758016
2  2013-02-12  78.39  78.63  77.5132  78.60   876859
3  2013-02-13  78.90  79.13  77.8500  78.97  1038574
4  2013-02-14  78.66  79.72  78.5850  78.84  1005376

In [10]:
kaggle.date.dtype

dtype('O')

As the Date column is in string format, convert it to datetime format.

In [11]:
kaggle.date = pd.to_datetime(kaggle.date)

In [12]:
kaggle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1259 non-null   datetime64[ns]
 1   open    1259 non-null   float64
 2   high    1259 non-null   float64
 3   low     1259 non-null   float64
 4   close   1259 non-null   float64
 5   volume  1259 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 59.1 KB

Lets find the range of the data by seeing the start and end date of the data.

In [13]:
kaggle.date.head(1)

0   2013-02-08
Name: date, dtype: datetime64[ns]

In [14]:
kaggle.date.tail(1)

1258   2018-02-07
Name: date, dtype: datetime64[ns]

We have the info of the dataset from 2013-02-08 to 2018-02-07.

Doing similar analysis and transformation for the scraped data.

In [15]:
scraped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1350 entries, 0 to 1349
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          1350 non-null   object
 1   Open          1350 non-null   float64
 2   High          1350 non-null   float64
 3   Low           1350 non-null   float64
 4   Close*        1350 non-null   float64
 5   Adj. close**  1350 non-null   float64
 6   Volume        1350 non-null   object
dtypes: float64(5), object(2)
memory usage: 74.0+ KB

In [16]:
scraped.isna().sum()

Date            0
Open            0
High            0
Low             0
Close*          0
Adj. close**    0
Volume          0
dtype: int64

In [18]:
scraped.head()

           Date   Open   High    Low  Close*  Adj. close**       Volume
0  Jan 05, 2018  43.36  43.84  43.26   43.75         41.97   94,640,000
1  Jan 04, 2018  43.13  43.37  43.02   43.26         41.49   89,738,400
2  Jan 03, 2018  43.13  43.64  42.99   43.06         41.30  118,071,600
3  Jan 02, 2018  42.54  43.08  42.31   43.06         41.31  102,223,600
4  Jan 12, 2018  44.04  44.34  43.91   44.27         42.47  101,672,400

In [17]:
scraped.columns

Index(['Date', 'Open', 'High', 'Low', 'Close*', 'Adj. close**', 'Volume'], dtype='object')

We can see the scraped data has two chosing prices. As both are not required, we consider only the adjusted closing price.

In [19]:
scraped.drop('Close*', axis=1, inplace=True)

In [20]:
scraped.head()

           Date   Open   High    Low  Adj. close**       Volume
0  Jan 05, 2018  43.36  43.84  43.26         41.97   94,640,000
1  Jan 04, 2018  43.13  43.37  43.02         41.49   89,738,400
2  Jan 03, 2018  43.13  43.64  42.99         41.30  118,071,600
3  Jan 02, 2018  42.54  43.08  42.31         41.31  102,223,600
4  Jan 12, 2018  44.04  44.34  43.91         42.47  101,672,400

In [21]:
scraped.Date.dtype

dtype('O')

The date is in object format so convert it to datetime format.

In [22]:
scraped.Date = pd.to_datetime(scraped.Date)

Check date range of the scraped data.

In [39]:
scraped.date.head(1)

0   2018-01-05
Name: date, dtype: datetime64[ns]

In [40]:
scraped.date.tail(1)

1349   2023-05-08
Name: date, dtype: datetime64[ns]

The range of date for scraped data is from 2018-01-05 to 2023-05-08. So, there is a overlap of about 2 months between the two datasets. This can be treated during the combining phase of the two datasets.

Change the column names to match the kaggle dataset

In [23]:
scraped.columns = ['date', 'open', 'high', 'low', 'close', 'volume']

In [24]:
scraped.head()

        date   open   high    low  close       volume
0 2018-01-05  43.36  43.84  43.26  41.97   94,640,000
1 2018-01-04  43.13  43.37  43.02  41.49   89,738,400
2 2018-01-03  43.13  43.64  42.99  41.30  118,071,600
3 2018-01-02  42.54  43.08  42.31  41.31  102,223,600
4 2018-01-12  44.04  44.34  43.91  42.47  101,672,400

In [25]:
kaggle.head()

        date   open   high      low  close   volume
0 2013-02-08  78.34  79.72  78.0100  78.90  1298137
1 2013-02-11  78.65  78.91  77.2300  78.39   758016
2 2013-02-12  78.39  78.63  77.5132  78.60   876859
3 2013-02-13  78.90  79.13  77.8500  78.97  1038574
4 2013-02-14  78.66  79.72  78.5850  78.84  1005376

In [26]:
scraped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1350 entries, 0 to 1349
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1350 non-null   datetime64[ns]
 1   open    1350 non-null   float64
 2   high    1350 non-null   float64
 3   low     1350 non-null   float64
 4   close   1350 non-null   float64
 5   volume  1350 non-null   object
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 63.4+ KB

In [27]:
kaggle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1259 non-null   datetime64[ns]
 1   open    1259 non-null   float64
 2   high    1259 non-null   float64
 3   low     1259 non-null   float64
 4   close   1259 non-null   float64
 5   volume  1259 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 59.1 KB

Convert volume of scraped dataset to int64 format by first removing the commas.

In [32]:
scraped.volume = scraped.volume.str.replace(',', '')

In [33]:
scraped.volume = scraped.volume.astype('int64')

In [34]:
scraped.volume.dtype

dtype('int64')

In [35]:
kaggle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1259 non-null   datetime64[ns]
 1   open    1259 non-null   float64
 2   high    1259 non-null   float64
 3   low     1259 non-null   float64
 4   close   1259 non-null   float64
 5   volume  1259 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 59.1 KB

In [36]:
scraped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1350 entries, 0 to 1349
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1350 non-null   datetime64[ns]
 1   open    1350 non-null   float64
 2   high    1350 non-null   float64
 3   low     1350 non-null   float64
 4   close   1350 non-null   float64
 5   volume  1350 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 63.4 KB

Save the transformed data to csv file.

In [37]:
# save the dataframes to csv files
kaggle.to_csv('kaggle_transformed.csv', index=False)
scraped.to_csv('scraped_transformed.csv', index=False)

As all the data types are similar, they can now be combined into a single dataset and saved to a csv file which is the part of Load in ETL done in the next notebook.